tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
        if (liveZone.calibrationSteadyDetected) {
            Esp32BaseWeb::sendChunk("已确认");
        } else if (!status.flowEstablished) {
            Esp32BaseWeb::sendChunk("等待水流");
        } else if (liveZone.calibrationCollectedWindows >=
                   liveZone.calibrationRequiredWindows) {
            Esp32BaseWeb::sendChunk("波动偏大");
        } else {
            Esp32BaseWeb::sendChunk("已采集 ");
            sendUnsigned(liveZone.calibrationCollectedWindows);
            Esp32BaseWeb::sendChunk(" / ");
            sendUnsigned(liveZone.calibrationRequiredWindows);
            Esp32BaseWeb::sendChunk(" 个窗口");
        }
        Esp32BaseWeb::sendChunk("</b><span>稳态确认进度</span><small id='cal-steady-help'>"); if (liveZone.calibrationSteadyDetected) Esp32BaseWeb::sendChunk("后续波动仍会继续监测"); else if (!status.flowEstablished) Esp32BaseWeb::sendChunk("检测到脉冲后开始统计"); else if (liveZone.calibrationCollectedWindows >= liveZone.calibrationRequiredWindows) { Esp32BaseWeb::sendChunk("最近 "); sendUnsigned(liveZone.calibrationRequiredWindows); Esp32BaseWeb::sendChunk(" 个窗口尚未满足波动要求，继续识别"); } else { Esp32BaseWeb::sendChunk("收满 "); sendUnsigned(liveZone.calibrationRequiredWindows); Esp32BaseWeb::sendChunk(" 个窗口后比较速率波动"); } Esp32BaseWeb::sendChunk("</small></div><div class='metric'><b id='cal-remaining'>"); sendDuration(status.currentZoneRemainingSec); Esp32BaseWeb::sendChunk("</b><span>剩余上限</span></div></div><div class='cal-live-note'><span>检测规则：<b>每个窗口 "); sendUnsigned(liveZone.calibrationWindowSec); Esp32BaseWeb::sendChunk(" 秒，需连续 "); sendUnsigned(liveZone.calibrationRequiredWindows); Esp32BaseWeb::sendChunk(" 个，窗口速率波动不超过 "); sendUnsigned(liveZone.calibrationAllowedVariationPercent); Esp32BaseWeb::sendChunk("%</b></span><span>启动阶段：<b id='cal-startup-phase'>"); if (liveZone.calibrationSteadyDetected) { sendMilliseconds(liveZone.calibrationSteadyStartedMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(liveZone.calibrationStartupPulses); Esp32BaseWeb::sendChunk(" 脉冲"); } else Esp32BaseWeb::sendChunk("等待稳态确认"); Esp32BaseWeb::sendChunk("</b></span><span>稳态阶段：<b id='cal-steady-phase'>"); if (liveZone.calibrationSteadyDetected) { sendMilliseconds(liveZone.calibrationSteadyDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(liveZone.calibrationSteadyPulses); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(liveSteadyRate); Esp32BaseWeb::sendChunk(" P/s"); } else Esp32BaseWeb::sendChunk("尚未开始"); Esp32BaseWeb::sendChunk("</b></span><span>最近窗口：<b id='cal-rate'>"); Esp32BaseWeb::writeHtmlEscaped(liveRate); Esp32BaseWeb::sendChunk(" P/s</b></span></div><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='stop'><div class='actions'><input class='danger' type='submit' value='停止本次采样'></div></form></div>");
    } else if (calibration.hasPendingMeasurement()) {
        const uint8_t pendingZoneId = calibration.pendingZoneId();
        const char* pendingZoneName = pendingZoneId >= 1 && pendingZoneId <= config->zones.size()
                                          ? config->zones[pendingZoneId - 1U].name.data()
                                          : "未知水路";
        const FlowCalibrationService::Sample* pending = calibration.pendingSample();
        char pendingSteadyRate[24]{};
        formatPulseRate(pending->steadyPulseCount, pending->steadyDurationMs,
                        pendingSteadyRate, sizeof(pendingSteadyRate));
        Esp32BaseWeb::sendChunk("<div class='cal-pending'><div class='cal-pending-summary'><h3>本次采样已停止</h3><p class='cal-pending-route'>采样水路："); Esp32BaseWeb::writeHtmlEscaped(pendingZoneName); Esp32BaseWeb::sendChunk("</p><div class='cal-phase-grid'><div class='cal-phase'><span class='cal-phase-label'>启动阶段</span><span class='cal-phase-value'>"); sendMilliseconds(pending->steadyStartedMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(pending->startupPulseCount); Esp32BaseWeb::sendChunk(" 脉冲</span><span class='cal-phase-note'>从开阀到进入稳态</span></div><div class='cal-phase'><span class='cal-phase-label'>稳态阶段</span><span class='cal-phase-value'>"); sendMilliseconds(pending->steadyDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(pending->steadyPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(pendingSteadyRate); Esp32BaseWeb::sendChunk(" P/s</span><span class='cal-phase-note'>从进入稳态到停止命令</span></div></div><p class='cal-pending-total'>完整采样："); sendDuration(calibration.pendingElapsedSec()); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(calibration.pendingPulseCount()); Esp32BaseWeb::sendChunk(" 脉冲"); if (pending->stopPulseCount != 0) { Esp32BaseWeb::sendChunk("<br><span class='cal-pending-warning'>停止后仍检测到 "); sendUnsigned(pending->stopPulseCount); Esp32BaseWeb::sendChunk(" 个脉冲，估算启动水量可能包含少量关闭尾水。</span>"); } Esp32BaseWeb::sendChunk("</p></div><div><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='measurement'><div class='fieldgrid'><p class='field full'><label>本次实测总水量</label><input type='number' name='measured_ml' min='1000' max='1000000' step='1' inputmode='numeric' required autofocus><small>填写启动和稳态期间实际接到的全部水量，单位 mL。</small></p></div><div class='actions'><input type='submit' value='保存有效样本'></div></form><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return confirm(&quot;确认本次接水无效？该样本会保留，但不参与计算。&quot;)&&once(this)'><input type='hidden' name='action' value='invalid'><div class='actions'><input class='secondary' type='submit' value='本次接水无效'></div></form></div></div>");
    } else if (calibration.sampleCount() < FlowCalibrationService::kMaximumSamples) {
        bool hasEligibleZone = false;
        for (const ZoneConfig& zone : config->zones) {
            hasEligibleZone = hasEligibleZone || zone.enabled;
        }
        if (hasEligibleZone) {
            Esp32BaseWeb::sendChunk("<form class='cal-start-form' method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认开始新样本？所选水路会立即出水。')&&once(this)\"><input type='hidden' name='action' value='start'><div class='cal-start-picker'><label>校准水路</label><div class='cal-start-controls'><select name='zone_id'>");
            for (const ZoneConfig& zone : config->zones) if (zone.enabled) { Esp32BaseWeb::sendChunk("<option value='"); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data()); Esp32BaseWeb::sendChunk("</option>"); }
            Esp32BaseWeb::sendChunk("</select><div class='actions'><input type='submit' value='开始新样本'></div></div></div><div class='cal-start-info'><b>已保存 "); sendUnsigned(calibration.sampleCount()); Esp32BaseWeb::sendChunk(" / 10 个样本，还可增加 "); sendUnsigned(FlowCalibrationService::kMaximumSamples - calibration.sampleCount()); Esp32BaseWeb::sendChunk(" 个</b><span>每个样本可重新选择水路。稳态判定：每个窗口 "); sendUnsigned(config->calibrationStability.windowSec); Esp32BaseWeb::sendChunk(" 秒，需连续 "); sendUnsigned(config->calibrationStability.requiredWindows); Esp32BaseWeb::sendChunk(" 个，窗口速率波动不超过 "); sendUnsigned(config->calibrationStability.allowedVariationPercent); Esp32BaseWeb::sendChunk("%。</span></div></form>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                                     "没有可用于校准的水路",
                                     "请先启用至少一条水路。");
        }
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "已达到 10 个样本", "请删除不需要的样本，或全部清空后重新开始。");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("校准样本");
    Esp32BaseWeb::sendChunk("<div class='cal-sample-toolbar'><div class='cal-counts'><span class='cal-count'><b>"); sendUnsigned(calibration.sampleCount()); Esp32BaseWeb::sendChunk("/10</b> 全部样本</span><span class='cal-count ok'><b>"); sendUnsigned(calibration.validSampleCount()); Esp32BaseWeb::sendChunk("</b> 有效</span><span class='cal-count bad'><b>"); sendUnsigned(calibration.sampleCount() - calibration.validSampleCount()); Esp32BaseWeb::sendChunk("</b> 无效</span></div>");
    if (calibration.sampleCount() != 0 && !managementLocked) Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认清空全部校准样本？设备当前使用的流量系数不会改变。')&&once(this)\"><input type='hidden' name='action' value='clear'><input class='danger' type='submit' value='全部清空'></form>");
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::sendChunk("<p class='cal-sample-guide'>阶段数据格式为“时长 · 脉冲”；稳态另显示平均 P/s 和换算流量。稳态判定：每个窗口 "); sendUnsigned(config->calibrationStability.windowSec); Esp32BaseWeb::sendChunk(" 秒，连续 "); sendUnsigned(config->calibrationStability.requiredWindows); Esp32BaseWeb::sendChunk(" 个窗口的速率波动不超过 "); sendUnsigned(config->calibrationStability.allowedVariationPercent); Esp32BaseWeb::sendChunk("%。无效样本保留记录但不参与计算。</p>");
    if (calibration.sampleCount() == 0) {
        Esp32BaseWeb::sendChunk("<div class='cal-empty'><p class='cal-empty-title'>尚无校准样本</p><p class='cal-empty-text'>完成第一次采样后，有效和无效样本都会显示在这里。</p></div>");
    } else {
        Esp32BaseWeb::sendChunk("<div class='cal-sample-list'><div class='cal-sample-columns'><span>样本</span><span>接水记录</span><span>启动阶段</span><span>稳态阶段</span><span>拟合诊断</span><span>操作</span></div>");
        for (uint8_t index = 0; index < calibration.sampleCount(); ++index) {
            const FlowCalibrationService::Sample* sample = calibration.sample(index);
            const char* sampleZoneName = sample->zoneId >= 1 && sample->zoneId <= config->zones.size()
                                             ? config->zones[sample->zoneId - 1U].name.data()
                                             : "未知水路";
            char steadyRate[24]{};
            formatPulseRate(sample->steadyPulseCount, sample->steadyDurationMs,
                            steadyRate, sizeof(steadyRate));
            char sampleFlow[20]{};
            const uint32_t sampleFlowMlPerMinute = calibration.resultReady()
                                                        ? calculateFlowMlPerMinute(
                                                              sample->steadyPulseCount,
                                                              sample->steadyDurationMs,
                                                              calibration.combinedPulsesPerLiterX100())
                                                        : 0;
            const bool sampleFlowReady = sampleFlowMlPerMinute <= 100000U &&
                                         IrrigationConfigRules::formatLitersPerMinute(
                                             sampleFlowMlPerMinute,
                                             sampleFlow,
                                             sizeof(sampleFlow));
            Esp32BaseWeb::sendChunk("<article class='cal-sample'><div class='cal-sample-cell'><span class='cal-sample-main'>样本 "); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("<span class='cal-status "); Esp32BaseWeb::sendChunk(sample->valid ? "ok'>有效" : "bad'>无效"); Esp32BaseWeb::sendChunk("</span></span><span class='cal-sample-sub'>"); Esp32BaseWeb::writeHtmlEscaped(sampleZoneName); Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-cell'><span class='cal-sample-main'>");
            if (sample->valid) { sendUnsigned(sample->measuredWaterMl); Esp32BaseWeb::sendChunk(" mL"); } else Esp32BaseWeb::sendChunk("未填写水量");
            Esp32BaseWeb::sendChunk("</span><span class='cal-sample-sub'>"); sendUnsigned(sample->pulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); sendDuration(sample->elapsedSec); Esp32BaseWeb::sendChunk("</span>"); if (sample->stopPulseCount != 0) { Esp32BaseWeb::sendChunk("<span class='cal-sample-sub warn'>停止后仍有 "); sendUnsigned(sample->stopPulseCount); Esp32BaseWeb::sendChunk(" 个脉冲</span>"); } Esp32BaseWeb::sendChunk("</div><div class='cal-sample-cell'><span class='cal-sample-main'>");
            if (sample->steadyDetected) { sendMilliseconds(sample->steadyStartedMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(sample->startupPulseCount); Esp32BaseWeb::sendChunk(" 脉冲"); } else Esp32BaseWeb::sendChunk("未识别稳态");
            Esp32BaseWeb::sendChunk("</span><span class='cal-sample-sub'>首次出水 "); sendMilliseconds(sample->flowEstablishedMs); Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-cell'><span class='cal-sample-main'>");
            if (sample->steadyDetected) { sendMilliseconds(sample->steadyDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(sample->steadyPulseCount); Esp32BaseWeb::sendChunk(" 脉冲</span><span class='cal-sample-sub'>"); Esp32BaseWeb::writeHtmlEscaped(steadyRate); Esp32BaseWeb::sendChunk(" P/s"); if (sampleFlowReady && sampleFlowMlPerMinute != 0) { Esp32BaseWeb::sendChunk(" · "); Esp32BaseWeb::writeHtmlEscaped(sampleFlow); Esp32BaseWeb::sendChunk(" L/min"); } if (sample->steadyLaterUnstable) Esp32BaseWeb::sendChunk(" · 后续有波动"); } else Esp32BaseWeb::sendChunk("—</span><span class='cal-sample-sub'>不参与计算"); Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-cell'>");
            if (!sample->valid) {
                Esp32BaseWeb::sendChunk("<span class='cal-sample-main'>不参与计算</span><span class='cal-sample-sub'>"); Esp32BaseWeb::writeHtmlEscaped(sample->stopReason == WateringStopReason::Completed ? "达到 10 分钟上限" : stopReasonName(sample->stopReason)); Esp32BaseWeb::sendChunk("</span>");
            } else if (!calibration.resultReady()) {
                Esp32BaseWeb::sendChunk("<span class='cal-sample-main'>等待计算</span><span class='cal-sample-sub'>需要两个不同水量的有效样本</span>");
            } else {
                char residualPulse[32]{}, residualPercent[32]{};
                formatSignedHundredths(sample->residualPulseX100,
                                       residualPulse,
                                       sizeof(residualPulse),
                                       true);
                formatSignedHundredths(sample->residualPercentX100,
                                       residualPercent,
                                       sizeof(residualPercent),
                                       true);
                char startupWater[32]{};
                formatSignedHundredths(sample->estimatedStartupWaterMlX100,
                                       startupWater,
                                       sizeof(startupWater),
                                       true);
                Esp32BaseWeb::sendChunk("<span class='cal-sample-main'>估算启动水量 "); Esp32BaseWeb::writeHtmlEscaped(startupWater); Esp32BaseWeb::sendChunk(" mL</span><span class='cal-sample-sub'>偏差 "); Esp32BaseWeb::writeHtmlEscaped(residualPulse); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(residualPercent); Esp32BaseWeb::sendChunk("%</span>");
            }
            Esp32BaseWeb::sendChunk("</div><div class='cal-sample-actions'>");
            if (!managementLocked) {
                if (sample->valid) { Esp32BaseWeb::sendChunk("<button class='secondary' type='button' onclick=\"document.getElementById('cal-edit-"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("').showModal()\">修改</button>"); }
                Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认删除这个样本？删除后无法恢复。')&&once(this)\"><input type='hidden' name='action' value='delete'><input type='hidden' name='sample' value='"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("'><input class='danger' type='submit' value='删除'></form>");
            }
            Esp32BaseWeb::sendChunk("</div></article>");
        }
        Esp32BaseWeb::sendChunk("</div>");
    }
    Esp32BaseWeb::endPanel();

